#include<stdio.h>                 /* 编译预处理命令 */
int main()                        /* 主函数 */
{
	double a = 1, b = 1, sum = 1; /* 定义变量（a：分母变量，b：分子变量，sum：和变量） */
	double x, t;                  /* 定义变量（x：第n项变量，t：中间变量） */
	int i, n;                     /* 定义变量（i：循环变量，n：正整数变量） */
	printf("Input n(n>0):");      /* 输入提示 */
	scanf("%d", &n);            /* 输入一个正整数n */
	for (i = 2; i <= n; i++)      /* for循环语句：i从1开始，到n结束，每次增加1 */
	{
		t = b;                    /* 令t等于前一项的分子 */
		b = a;                    /* 令第n项的分子=前一项的分母 */
		a = a + t;                /* 令第n项的分母=前一项的分子和分母之和*/
		x = b / a;                /* 先令第n项=分子/分母 */
		if (i % 2 == 0)           /* 如果i为偶数 */
		{
			x = -x;               /* 第n项的符号由+变成- */
		}
		sum = sum + x;            /* 累加前n项和 */
	}
	printf("sum = %lf", sum);   /* 输出累加和sum，保留2位小数 */
	return 0;                     /* 函数返回0 */
}