#include "stdio.h"                                            /* 编译预处理命令 */
int main()                                                    /* 主函数 */
{
	double x,y;                                               /* 定义变量（x：工资，y：所得税） */
	printf("Input x(x≥0):");                                  /* 输入提示 */
	scanf("%lf",&x);                                          /* 输入一个非负数x */
	if(x<0)                                                   /* 若x<0 */
	    printf("Data error!");                                /* 则输出错误提示 */
	else
	{
		if(x<=30000)                                          /* 若x≤30000 */
		    y=0;                                              /* 则y=0 */
		else if(x<=50000)
		    y=3.0/100*(x-30000);                              /* 则y=(x-30000)*3% */
	    else if(x<=100000)                                    /* 若50000<x≤100000 */
		    y=3.0/100*20000+6.0/100*(x-50000);                /* 则20000*3%+(x-50000)*6% */
	    else                                                  /* 若x>100000 */
		    y=3.0/100*20000+6.0/100*50000+10.0/100*(x-100000);/* 则y=20000*3%+50000*6%+(x-100000)*10% */
	    printf("y=f(%lf)=%.2lf",x,y);                         /* 输出结果，保留2位小数 */
	}
	return 0;                                                 /* 函数返回0 */
}